# ComboBoxCurrentChangedEventArgs Properties

---
The ComboBoxCurrentChangedEventArgs type exposes the following members.
| Name| Description
---|---|---
| Application|  The current UIApplication. (Inherited from RibbonItemEventArgs)
| NewValue| The current item for the ComboBox after the change.
| OldValue| The current item for the ComboBox before the change.
Top
#### Reference
ComboBoxCurrentChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace